amaury10/btt_ktouch_custom/firmware/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_OFFSET=0x8000

CONFIG_BOOTLOADER_FLASH_DC_AWARE=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
# Notre application tourne sous le bootloader d'origine, que nous ne
# remplaçons pas et dont nous n'avons pas vérifié qu'il accepte 120 MHz :
# 80 MHz pour le premier vol.
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# --- PSRAM : seule parade au trou pré-app_main (voir rescue.c) ---
# Ces réglages viennent du BSP du Panda Touch 7 pouces ; toute la question de
# ce jalon est de savoir si la K-Touch 5 pouces lui ressemble. Sans
# IGNORE_NOTFOUND, une PSRAM absente ou incompatible est fatale dans
# cpu_start.c, avant l'ordonnanceur et avant app_main — donc avant que le
# compteur de démarrages, le minuteur ou le serveur HTTP n'aient tourné une
# seule fois. Avec IGNORE_NOTFOUND, ce même défaut se traduit à la place par
# un échec propre de l'allocation du tampon LVGL dans le BSP, donc par un
# pt_display_init() qui rend une erreur : on retombe dans le cas déjà géré
# (écran mort, WiFi et /revert bien vivants), au lieu d'un appareil perdu.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_IGNORE_NOTFOUND=y
CONFIG_SPIRAM_SPEED_80M=y
# IGNORE_NOTFOUND ne couvre que « PSRAM introuvable », pas « trouvée mais peu
# fiable » — et c'est justement le mode de défaillance le plus probable d'une
# configuration 7 pouces sur du matériel 5 pouces. Le test mémoire vaut y par
# défaut et appelle abort() dans cpu_start.c quand il échoue, donc avant
# app_main : il rouvrirait exactement le trou que le bloc ci-dessus ferme.
# Désactivé pour que le défaut se manifeste plus tard, dans une allocation qui
# échoue proprement, là où le firmware sait dégrader au lieu de mourir.
CONFIG_SPIRAM_MEMTEST=n
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP32S3_DATA_CACHE_LINE_64B=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10

# --- Sauvetage (rescue.c) : ces trois réglages sont désormais une garantie de
# sécurité, pas de simples valeurs par défaut, et sont donc pinnés ici. ---
# Une panique doit toujours redémarrer l'appareil (jamais s'arrêter en
# attendant un débogueur) : c'est ce qui permet au compteur de démarrages en
# RTC_NOINIT_ATTR de détecter une boucle de redémarrage et de rebasculer.
CONFIG_ESP_SYSTEM_PANIC_PRINT_REBOOT=y
# Un dépassement du chien de garde applicatif doit lui aussi provoquer une
# panique — donc un redémarrage — et pas seulement un message : sans ça, une
# tâche bloquée ne redémarre jamais et aucun sauvetage ne se déclenche.
CONFIG_ESP_TASK_WDT_PANIC=y
# Le rappel du minuteur de sauvetage (rescue.c) ne fait plus que réveiller une
# tâche dédiée (voir tache_sur_echeance) : cette pile reste volontairement
# étroite, la valeur par défaut suffit largement.
CONFIG_ESP_TIMER_TASK_STACK_SIZE=3584

CONFIG_FREERTOS_HZ=1000
CONFIG_LV_USE_CUSTOM_MALLOC=y
CONFIG_LV_COLOR_MIX_ROUND_OFS=0
CONFIG_LV_BUILD_EXAMPLES=n
CONFIG_IDF_EXPERIMENTAL_FEATURES=y

# --- Polices LVGL : habillage.c, tuile.c, progression.c, clavier.c et
# ecran_accueil.c utilisent Montserrat 20/28/48, absentes de la config LVGL
# par defaut du BSP. Sans elles, la declaration des polices est masquee par
# #if LV_FONT_MONTSERRAT_xx et la compilation cible echoue (identifiant non
# declare, -Werror) — piege deja rencontre : sdkconfig.defaults ne remplace
# jamais un symbole deja present dans un sdkconfig genere, donc tout ajout ici
# exige de supprimer firmware/sdkconfig et de regenerer (voir task-10-report.md).
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_28=y
CONFIG_LV_FONT_MONTSERRAT_48=y
